pr10/re2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          50;
        startFace       9485;
    }
    outlet
    {
        type            patch;
        nFaces          50;
        startFace       9535;
    }
    bounds
    {
        type            wall;
        nFaces          100;
        startFace       9585;
    }
    cylinder
    {
        type            wall;
        nFaces          25;
        startFace       9685;
    }
    empty
    {
        type            empty;
        nFaces          12630;
        startFace       9710;
    }
)

// ************************************************************************* //
